Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpio.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32U5Gx_gpio equates.
 */

#pragma once

#include    <stdint.h>

// GPIO address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    MODER;
    volatile    uint32_t    OTYPER;
    volatile    uint32_t    OSPEEDR;
    volatile    uint32_t    PUPDR;
    volatile    uint32_t    IDR;
    volatile    uint32_t    ODR;
    volatile    uint32_t    BSRR;
    volatile    uint32_t    LCKR;
    volatile    uint32_t    AFRL;
    volatile    uint32_t    AFRH;
    volatile    uint32_t    BRR;
    volatile    uint32_t    HSLVR;
    volatile    uint32_t    SECCFGR;
} GPIO_TypeDef;

#ifdef __cplusplus
#define GPIOA_NS    reinterpret_cast<GPIO_TypeDef *>(0x42020000U)
#define GPIOA_S     reinterpret_cast<GPIO_TypeDef *>(0x52020000U)
#define GPIOB_NS    reinterpret_cast<GPIO_TypeDef *>(0x42020400U)
#define GPIOB_S     reinterpret_cast<GPIO_TypeDef *>(0x52020400U)
#define GPIOC_NS    reinterpret_cast<GPIO_TypeDef *>(0x42020800U)
#define GPIOC_S     reinterpret_cast<GPIO_TypeDef *>(0x52020800U)
#define GPIOD_NS    reinterpret_cast<GPIO_TypeDef *>(0x42020C00U)
#define GPIOD_S     reinterpret_cast<GPIO_TypeDef *>(0x52020C00U)
#define GPIOE_NS    reinterpret_cast<GPIO_TypeDef *>(0x42021000U)
#define GPIOE_S     reinterpret_cast<GPIO_TypeDef *>(0x52021000U)
#define GPIOF_NS    reinterpret_cast<GPIO_TypeDef *>(0x42021400U)
#define GPIOF_S     reinterpret_cast<GPIO_TypeDef *>(0x52021400U)
#define GPIOG_NS    reinterpret_cast<GPIO_TypeDef *>(0x42021800U)
#define GPIOG_S     reinterpret_cast<GPIO_TypeDef *>(0x52021800U)
#define GPIOH_NS    reinterpret_cast<GPIO_TypeDef *>(0x42021C00U)
#define GPIOH_S     reinterpret_cast<GPIO_TypeDef *>(0x52021C00U)
#define GPIOI_NS    reinterpret_cast<GPIO_TypeDef *>(0x42022000U)
#define GPIOI_S     reinterpret_cast<GPIO_TypeDef *>(0x52022000U)
#define GPIOJ_NS    reinterpret_cast<GPIO_TypeDef *>(0x42022400U)
#define GPIOJ_S     reinterpret_cast<GPIO_TypeDef *>(0x52022400U)

#else
#define GPIOA_NS    ((GPIO_TypeDef *)0x42020000U)
#define GPIOA_S     ((GPIO_TypeDef *)0x52020000U)
#define GPIOB_NS    ((GPIO_TypeDef *)0x42020400U)
#define GPIOB_S     ((GPIO_TypeDef *)0x52020400U)
#define GPIOC_NS    ((GPIO_TypeDef *)0x42020800U)
#define GPIOC_S     ((GPIO_TypeDef *)0x52020800U)
#define GPIOD_NS    ((GPIO_TypeDef *)0x42020C00U)
#define GPIOD_S     ((GPIO_TypeDef *)0x52020C00U)
#define GPIOE_NS    ((GPIO_TypeDef *)0x42021000U)
#define GPIOE_S     ((GPIO_TypeDef *)0x52021000U)
#define GPIOF_NS    ((GPIO_TypeDef *)0x42021400U)
#define GPIOF_S     ((GPIO_TypeDef *)0x52021400U)
#define GPIOG_NS    ((GPIO_TypeDef *)0x42021800U)
#define GPIOG_S     ((GPIO_TypeDef *)0x52021800U)
#define GPIOH_NS    ((GPIO_TypeDef *)0x42021C00U)
#define GPIOH_S     ((GPIO_TypeDef *)0x52021C00U)
#define GPIOI_NS    ((GPIO_TypeDef *)0x42022000U)
#define GPIOI_S     ((GPIO_TypeDef *)0x52022000U)
#define GPIOJ_NS    ((GPIO_TypeDef *)0x42022400U)
#define GPIOJ_S     ((GPIO_TypeDef *)0x52022400U)
#endif

// MODER Configuration

#define GPIO_MODER_MODE15               (0x3U<<30U)
#define GPIO_MODER_MODE15_0             (0x1U<<30U)
#define GPIO_MODER_MODE14               (0x3U<<28U)
#define GPIO_MODER_MODE14_0             (0x1U<<28U)
#define GPIO_MODER_MODE13               (0x3U<<26U)
#define GPIO_MODER_MODE13_0             (0x1U<<26U)
#define GPIO_MODER_MODE12               (0x3U<<24U)
#define GPIO_MODER_MODE12_0             (0x1U<<24U)
#define GPIO_MODER_MODE11               (0x3U<<22U)
#define GPIO_MODER_MODE11_0             (0x1U<<22U)
#define GPIO_MODER_MODE10               (0x3U<<20U)
#define GPIO_MODER_MODE10_0             (0x1U<<20U)
#define GPIO_MODER_MODE9                (0x3U<<18U)
#define GPIO_MODER_MODE9_0              (0x1U<<18U)
#define GPIO_MODER_MODE8                (0x3U<<16U)
#define GPIO_MODER_MODE8_0              (0x1U<<16U)
#define GPIO_MODER_MODE7                (0x3U<<14U)
#define GPIO_MODER_MODE7_0              (0x1U<<14U)
#define GPIO_MODER_MODE6                (0x3U<<12U)
#define GPIO_MODER_MODE6_0              (0x1U<<12U)
#define GPIO_MODER_MODE5                (0x3U<<10U)
#define GPIO_MODER_MODE5_0              (0x1U<<10U)
#define GPIO_MODER_MODE4                (0x3U<<8U)
#define GPIO_MODER_MODE4_0              (0x1U<<8U)
#define GPIO_MODER_MODE3                (0x3U<<6U)
#define GPIO_MODER_MODE3_0              (0x1U<<6U)
#define GPIO_MODER_MODE2                (0x3U<<4U)
#define GPIO_MODER_MODE2_0              (0x1U<<4U)
#define GPIO_MODER_MODE1                (0x3U<<2U)
#define GPIO_MODER_MODE1_0              (0x1U<<2U)
#define GPIO_MODER_MODE0                (0x3U<<0U)
#define GPIO_MODER_MODE0_0              (0x1U<<0U)
#define GPIO_MODER_MODE15_B_0X0         (0x0U<<30U)
#define GPIO_MODER_MODE15_B_0X1         (0x1U<<30U)
#define GPIO_MODER_MODE15_B_0X2         (0x2U<<30U)
#define GPIO_MODER_MODE15_B_0X3         (0x3U<<30U)
#define GPIO_MODER_MODE14_B_0X0         (0x0U<<28U)
#define GPIO_MODER_MODE14_B_0X1         (0x1U<<28U)
#define GPIO_MODER_MODE14_B_0X2         (0x2U<<28U)
#define GPIO_MODER_MODE14_B_0X3         (0x3U<<28U)
#define GPIO_MODER_MODE13_B_0X0         (0x0U<<26U)
#define GPIO_MODER_MODE13_B_0X1         (0x1U<<26U)
#define GPIO_MODER_MODE13_B_0X2         (0x2U<<26U)
#define GPIO_MODER_MODE13_B_0X3         (0x3U<<26U)
#define GPIO_MODER_MODE12_B_0X0         (0x0U<<24U)
#define GPIO_MODER_MODE12_B_0X1         (0x1U<<24U)
#define GPIO_MODER_MODE12_B_0X2         (0x2U<<24U)
#define GPIO_MODER_MODE12_B_0X3         (0x3U<<24U)
#define GPIO_MODER_MODE11_B_0X0         (0x0U<<22U)
#define GPIO_MODER_MODE11_B_0X1         (0x1U<<22U)
#define GPIO_MODER_MODE11_B_0X2         (0x2U<<22U)
#define GPIO_MODER_MODE11_B_0X3         (0x3U<<22U)
#define GPIO_MODER_MODE10_B_0X0         (0x0U<<20U)
#define GPIO_MODER_MODE10_B_0X1         (0x1U<<20U)
#define GPIO_MODER_MODE10_B_0X2         (0x2U<<20U)
#define GPIO_MODER_MODE10_B_0X3         (0x3U<<20U)
#define GPIO_MODER_MODE9_B_0X0          (0x0U<<18U)
#define GPIO_MODER_MODE9_B_0X1          (0x1U<<18U)
#define GPIO_MODER_MODE9_B_0X2          (0x2U<<18U)
#define GPIO_MODER_MODE9_B_0X3          (0x3U<<18U)
#define GPIO_MODER_MODE8_B_0X0          (0x0U<<16U)
#define GPIO_MODER_MODE8_B_0X1          (0x1U<<16U)
#define GPIO_MODER_MODE8_B_0X2          (0x2U<<16U)
#define GPIO_MODER_MODE8_B_0X3          (0x3U<<16U)
#define GPIO_MODER_MODE7_B_0X0          (0x0U<<14U)
#define GPIO_MODER_MODE7_B_0X1          (0x1U<<14U)
#define GPIO_MODER_MODE7_B_0X2          (0x2U<<14U)
#define GPIO_MODER_MODE7_B_0X3          (0x3U<<14U)
#define GPIO_MODER_MODE6_B_0X0          (0x0U<<12U)
#define GPIO_MODER_MODE6_B_0X1          (0x1U<<12U)
#define GPIO_MODER_MODE6_B_0X2          (0x2U<<12U)
#define GPIO_MODER_MODE6_B_0X3          (0x3U<<12U)
#define GPIO_MODER_MODE5_B_0X0          (0x0U<<10U)
#define GPIO_MODER_MODE5_B_0X1          (0x1U<<10U)
#define GPIO_MODER_MODE5_B_0X2          (0x2U<<10U)
#define GPIO_MODER_MODE5_B_0X3          (0x3U<<10U)
#define GPIO_MODER_MODE4_B_0X0          (0x0U<<8U)
#define GPIO_MODER_MODE4_B_0X1          (0x1U<<8U)
#define GPIO_MODER_MODE4_B_0X2          (0x2U<<8U)
#define GPIO_MODER_MODE4_B_0X3          (0x3U<<8U)
#define GPIO_MODER_MODE3_B_0X0          (0x0U<<6U)
#define GPIO_MODER_MODE3_B_0X1          (0x1U<<6U)
#define GPIO_MODER_MODE3_B_0X2          (0x2U<<6U)
#define GPIO_MODER_MODE3_B_0X3          (0x3U<<6U)
#define GPIO_MODER_MODE2_B_0X0          (0x0U<<4U)
#define GPIO_MODER_MODE2_B_0X1          (0x1U<<4U)
#define GPIO_MODER_MODE2_B_0X2          (0x2U<<4U)
#define GPIO_MODER_MODE2_B_0X3          (0x3U<<4U)
#define GPIO_MODER_MODE1_B_0X0          (0x0U<<2U)
#define GPIO_MODER_MODE1_B_0X1          (0x1U<<2U)
#define GPIO_MODER_MODE1_B_0X2          (0x2U<<2U)
#define GPIO_MODER_MODE1_B_0X3          (0x3U<<2U)
#define GPIO_MODER_MODE0_B_0X0          (0x0U<<0U)
#define GPIO_MODER_MODE0_B_0X1          (0x1U<<0U)
#define GPIO_MODER_MODE0_B_0X2          (0x2U<<0U)
#define GPIO_MODER_MODE0_B_0X3          (0x3U<<0U)

// OTYPER Configuration

