Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpio.h
#define GPIO_OTYPER_OT15                (0x1U<<15U)
#define GPIO_OTYPER_OT14                (0x1U<<14U)
#define GPIO_OTYPER_OT13                (0x1U<<13U)
#define GPIO_OTYPER_OT12                (0x1U<<12U)
#define GPIO_OTYPER_OT11                (0x1U<<11U)
#define GPIO_OTYPER_OT10                (0x1U<<10U)
#define GPIO_OTYPER_OT9                 (0x1U<<9U)
#define GPIO_OTYPER_OT8                 (0x1U<<8U)
#define GPIO_OTYPER_OT7                 (0x1U<<7U)
#define GPIO_OTYPER_OT6                 (0x1U<<6U)
#define GPIO_OTYPER_OT5                 (0x1U<<5U)
#define GPIO_OTYPER_OT4                 (0x1U<<4U)
#define GPIO_OTYPER_OT3                 (0x1U<<3U)
#define GPIO_OTYPER_OT2                 (0x1U<<2U)
#define GPIO_OTYPER_OT1                 (0x1U<<1U)
#define GPIO_OTYPER_OT0                 (0x1U<<0U)
#define GPIO_OTYPER_OT15_B_0X0          (0x0U<<15U)
#define GPIO_OTYPER_OT15_B_0X1          (0x1U<<15U)
#define GPIO_OTYPER_OT14_B_0X0          (0x0U<<14U)
#define GPIO_OTYPER_OT14_B_0X1          (0x1U<<14U)
#define GPIO_OTYPER_OT13_B_0X0          (0x0U<<13U)
#define GPIO_OTYPER_OT13_B_0X1          (0x1U<<13U)
#define GPIO_OTYPER_OT12_B_0X0          (0x0U<<12U)
#define GPIO_OTYPER_OT12_B_0X1          (0x1U<<12U)
#define GPIO_OTYPER_OT11_B_0X0          (0x0U<<11U)
#define GPIO_OTYPER_OT11_B_0X1          (0x1U<<11U)
#define GPIO_OTYPER_OT10_B_0X0          (0x0U<<10U)
#define GPIO_OTYPER_OT10_B_0X1          (0x1U<<10U)
#define GPIO_OTYPER_OT9_B_0X0           (0x0U<<9U)
#define GPIO_OTYPER_OT9_B_0X1           (0x1U<<9U)
#define GPIO_OTYPER_OT8_B_0X0           (0x0U<<8U)
#define GPIO_OTYPER_OT8_B_0X1           (0x1U<<8U)
#define GPIO_OTYPER_OT7_B_0X0           (0x0U<<7U)
#define GPIO_OTYPER_OT7_B_0X1           (0x1U<<7U)
#define GPIO_OTYPER_OT6_B_0X0           (0x0U<<6U)
#define GPIO_OTYPER_OT6_B_0X1           (0x1U<<6U)
#define GPIO_OTYPER_OT5_B_0X0           (0x0U<<5U)
#define GPIO_OTYPER_OT5_B_0X1           (0x1U<<5U)
#define GPIO_OTYPER_OT4_B_0X0           (0x0U<<4U)
#define GPIO_OTYPER_OT4_B_0X1           (0x1U<<4U)
#define GPIO_OTYPER_OT3_B_0X0           (0x0U<<3U)
#define GPIO_OTYPER_OT3_B_0X1           (0x1U<<3U)
#define GPIO_OTYPER_OT2_B_0X0           (0x0U<<2U)
#define GPIO_OTYPER_OT2_B_0X1           (0x1U<<2U)
#define GPIO_OTYPER_OT1_B_0X0           (0x0U<<1U)
#define GPIO_OTYPER_OT1_B_0X1           (0x1U<<1U)
#define GPIO_OTYPER_OT0_B_0X0           (0x0U<<0U)
#define GPIO_OTYPER_OT0_B_0X1           (0x1U<<0U)

// OSPEEDR Configuration

#define GPIO_OSPEEDR_OSPEED15           (0x3U<<30U)
#define GPIO_OSPEEDR_OSPEED15_0         (0x1U<<30U)
#define GPIO_OSPEEDR_OSPEED14           (0x3U<<28U)
#define GPIO_OSPEEDR_OSPEED14_0         (0x1U<<28U)
#define GPIO_OSPEEDR_OSPEED13           (0x3U<<26U)
#define GPIO_OSPEEDR_OSPEED13_0         (0x1U<<26U)
#define GPIO_OSPEEDR_OSPEED12           (0x3U<<24U)
#define GPIO_OSPEEDR_OSPEED12_0         (0x1U<<24U)
#define GPIO_OSPEEDR_OSPEED11           (0x3U<<22U)
#define GPIO_OSPEEDR_OSPEED11_0         (0x1U<<22U)
#define GPIO_OSPEEDR_OSPEED10           (0x3U<<20U)
#define GPIO_OSPEEDR_OSPEED10_0         (0x1U<<20U)
#define GPIO_OSPEEDR_OSPEED9            (0x3U<<18U)
#define GPIO_OSPEEDR_OSPEED9_0          (0x1U<<18U)
#define GPIO_OSPEEDR_OSPEED8            (0x3U<<16U)
#define GPIO_OSPEEDR_OSPEED8_0          (0x1U<<16U)
#define GPIO_OSPEEDR_OSPEED7            (0x3U<<14U)
#define GPIO_OSPEEDR_OSPEED7_0          (0x1U<<14U)
#define GPIO_OSPEEDR_OSPEED6            (0x3U<<12U)
#define GPIO_OSPEEDR_OSPEED6_0          (0x1U<<12U)
#define GPIO_OSPEEDR_OSPEED5            (0x3U<<10U)
#define GPIO_OSPEEDR_OSPEED5_0          (0x1U<<10U)
#define GPIO_OSPEEDR_OSPEED4            (0x3U<<8U)
#define GPIO_OSPEEDR_OSPEED4_0          (0x1U<<8U)
#define GPIO_OSPEEDR_OSPEED3            (0x3U<<6U)
#define GPIO_OSPEEDR_OSPEED3_0          (0x1U<<6U)
#define GPIO_OSPEEDR_OSPEED2            (0x3U<<4U)
#define GPIO_OSPEEDR_OSPEED2_0          (0x1U<<4U)
#define GPIO_OSPEEDR_OSPEED1            (0x3U<<2U)
#define GPIO_OSPEEDR_OSPEED1_0          (0x1U<<2U)
#define GPIO_OSPEEDR_OSPEED0            (0x3U<<0U)
#define GPIO_OSPEEDR_OSPEED0_0          (0x1U<<0U)
#define GPIO_OSPEEDR_OSPEED15_B_0X0     (0x0U<<30U)
#define GPIO_OSPEEDR_OSPEED15_B_0X1     (0x1U<<30U)
#define GPIO_OSPEEDR_OSPEED15_B_0X2     (0x2U<<30U)
#define GPIO_OSPEEDR_OSPEED15_B_0X3     (0x3U<<30U)
#define GPIO_OSPEEDR_OSPEED14_B_0X0     (0x0U<<28U)
#define GPIO_OSPEEDR_OSPEED14_B_0X1     (0x1U<<28U)
#define GPIO_OSPEEDR_OSPEED14_B_0X2     (0x2U<<28U)
#define GPIO_OSPEEDR_OSPEED14_B_0X3     (0x3U<<28U)
#define GPIO_OSPEEDR_OSPEED13_B_0X0     (0x0U<<26U)
#define GPIO_OSPEEDR_OSPEED13_B_0X1     (0x1U<<26U)
#define GPIO_OSPEEDR_OSPEED13_B_0X2     (0x2U<<26U)
#define GPIO_OSPEEDR_OSPEED13_B_0X3     (0x3U<<26U)
#define GPIO_OSPEEDR_OSPEED12_B_0X0     (0x0U<<24U)
#define GPIO_OSPEEDR_OSPEED12_B_0X1     (0x1U<<24U)
#define GPIO_OSPEEDR_OSPEED12_B_0X2     (0x2U<<24U)
#define GPIO_OSPEEDR_OSPEED12_B_0X3     (0x3U<<24U)
#define GPIO_OSPEEDR_OSPEED11_B_0X0     (0x0U<<22U)
#define GPIO_OSPEEDR_OSPEED11_B_0X1     (0x1U<<22U)
#define GPIO_OSPEEDR_OSPEED11_B_0X2     (0x2U<<22U)
#define GPIO_OSPEEDR_OSPEED11_B_0X3     (0x3U<<22U)
#define GPIO_OSPEEDR_OSPEED10_B_0X0     (0x0U<<20U)
#define GPIO_OSPEEDR_OSPEED10_B_0X1     (0x1U<<20U)
#define GPIO_OSPEEDR_OSPEED10_B_0X2     (0x2U<<20U)
#define GPIO_OSPEEDR_OSPEED10_B_0X3     (0x3U<<20U)
#define GPIO_OSPEEDR_OSPEED9_B_0X0      (0x0U<<18U)
#define GPIO_OSPEEDR_OSPEED9_B_0X1      (0x1U<<18U)
#define GPIO_OSPEEDR_OSPEED9_B_0X2      (0x2U<<18U)
#define GPIO_OSPEEDR_OSPEED9_B_0X3      (0x3U<<18U)
#define GPIO_OSPEEDR_OSPEED8_B_0X0      (0x0U<<16U)
#define GPIO_OSPEEDR_OSPEED8_B_0X1      (0x1U<<16U)
#define GPIO_OSPEEDR_OSPEED8_B_0X2      (0x2U<<16U)
#define GPIO_OSPEEDR_OSPEED8_B_0X3      (0x3U<<16U)
#define GPIO_OSPEEDR_OSPEED7_B_0X0      (0x0U<<14U)
#define GPIO_OSPEEDR_OSPEED7_B_0X1      (0x1U<<14U)
#define GPIO_OSPEEDR_OSPEED7_B_0X2      (0x2U<<14U)
#define GPIO_OSPEEDR_OSPEED7_B_0X3      (0x3U<<14U)
#define GPIO_OSPEEDR_OSPEED6_B_0X0      (0x0U<<12U)
#define GPIO_OSPEEDR_OSPEED6_B_0X1      (0x1U<<12U)
#define GPIO_OSPEEDR_OSPEED6_B_0X2      (0x2U<<12U)
#define GPIO_OSPEEDR_OSPEED6_B_0X3      (0x3U<<12U)
#define GPIO_OSPEEDR_OSPEED5_B_0X0      (0x0U<<10U)
#define GPIO_OSPEEDR_OSPEED5_B_0X1      (0x1U<<10U)
#define GPIO_OSPEEDR_OSPEED5_B_0X2      (0x2U<<10U)
#define GPIO_OSPEEDR_OSPEED5_B_0X3      (0x3U<<10U)
#define GPIO_OSPEEDR_OSPEED4_B_0X0      (0x0U<<8U)
#define GPIO_OSPEEDR_OSPEED4_B_0X1      (0x1U<<8U)
#define GPIO_OSPEEDR_OSPEED4_B_0X2      (0x2U<<8U)
#define GPIO_OSPEEDR_OSPEED4_B_0X3      (0x3U<<8U)
#define GPIO_OSPEEDR_OSPEED3_B_0X0      (0x0U<<6U)
#define GPIO_OSPEEDR_OSPEED3_B_0X1      (0x1U<<6U)
#define GPIO_OSPEEDR_OSPEED3_B_0X2      (0x2U<<6U)
#define GPIO_OSPEEDR_OSPEED3_B_0X3      (0x3U<<6U)
#define GPIO_OSPEEDR_OSPEED2_B_0X0      (0x0U<<4U)
#define GPIO_OSPEEDR_OSPEED2_B_0X1      (0x1U<<4U)
#define GPIO_OSPEEDR_OSPEED2_B_0X2      (0x2U<<4U)
#define GPIO_OSPEEDR_OSPEED2_B_0X3      (0x3U<<4U)
#define GPIO_OSPEEDR_OSPEED1_B_0X0      (0x0U<<2U)
#define GPIO_OSPEEDR_OSPEED1_B_0X1      (0x1U<<2U)
#define GPIO_OSPEEDR_OSPEED1_B_0X2      (0x2U<<2U)
#define GPIO_OSPEEDR_OSPEED1_B_0X3      (0x3U<<2U)
#define GPIO_OSPEEDR_OSPEED0_B_0X0      (0x0U<<0U)
#define GPIO_OSPEEDR_OSPEED0_B_0X1      (0x1U<<0U)
#define GPIO_OSPEEDR_OSPEED0_B_0X2      (0x2U<<0U)
#define GPIO_OSPEEDR_OSPEED0_B_0X3      (0x3U<<0U)

