Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpio.h
// PUPDR Configuration

#define GPIO_PUPDR_PUPD15               (0x3U<<30U)
#define GPIO_PUPDR_PUPD15_0             (0x1U<<30U)
#define GPIO_PUPDR_PUPD14               (0x3U<<28U)
#define GPIO_PUPDR_PUPD14_0             (0x1U<<28U)
#define GPIO_PUPDR_PUPD13               (0x3U<<26U)
#define GPIO_PUPDR_PUPD13_0             (0x1U<<26U)
#define GPIO_PUPDR_PUPD12               (0x3U<<24U)
#define GPIO_PUPDR_PUPD12_0             (0x1U<<24U)
#define GPIO_PUPDR_PUPD11               (0x3U<<22U)
#define GPIO_PUPDR_PUPD11_0             (0x1U<<22U)
#define GPIO_PUPDR_PUPD10               (0x3U<<20U)
#define GPIO_PUPDR_PUPD10_0             (0x1U<<20U)
#define GPIO_PUPDR_PUPD9                (0x3U<<18U)
#define GPIO_PUPDR_PUPD9_0              (0x1U<<18U)
#define GPIO_PUPDR_PUPD8                (0x3U<<16U)
#define GPIO_PUPDR_PUPD8_0              (0x1U<<16U)
#define GPIO_PUPDR_PUPD7                (0x3U<<14U)
#define GPIO_PUPDR_PUPD7_0              (0x1U<<14U)
#define GPIO_PUPDR_PUPD6                (0x3U<<12U)
#define GPIO_PUPDR_PUPD6_0              (0x1U<<12U)
#define GPIO_PUPDR_PUPD5                (0x3U<<10U)
#define GPIO_PUPDR_PUPD5_0              (0x1U<<10U)
#define GPIO_PUPDR_PUPD4                (0x3U<<8U)
#define GPIO_PUPDR_PUPD4_0              (0x1U<<8U)
#define GPIO_PUPDR_PUPD3                (0x3U<<6U)
#define GPIO_PUPDR_PUPD3_0              (0x1U<<6U)
#define GPIO_PUPDR_PUPD2                (0x3U<<4U)
#define GPIO_PUPDR_PUPD2_0              (0x1U<<4U)
#define GPIO_PUPDR_PUPD1                (0x3U<<2U)
#define GPIO_PUPDR_PUPD1_0              (0x1U<<2U)
#define GPIO_PUPDR_PUPD0                (0x3U<<0U)
#define GPIO_PUPDR_PUPD0_0              (0x1U<<0U)
#define GPIO_PUPDR_PUPD15_B_0X0         (0x0U<<30U)
#define GPIO_PUPDR_PUPD15_B_0X1         (0x1U<<30U)
#define GPIO_PUPDR_PUPD15_B_0X2         (0x2U<<30U)
#define GPIO_PUPDR_PUPD15_B_0X3         (0x3U<<30U)
#define GPIO_PUPDR_PUPD14_B_0X0         (0x0U<<28U)
#define GPIO_PUPDR_PUPD14_B_0X1         (0x1U<<28U)
#define GPIO_PUPDR_PUPD14_B_0X2         (0x2U<<28U)
#define GPIO_PUPDR_PUPD14_B_0X3         (0x3U<<28U)
#define GPIO_PUPDR_PUPD13_B_0X0         (0x0U<<26U)
#define GPIO_PUPDR_PUPD13_B_0X1         (0x1U<<26U)
#define GPIO_PUPDR_PUPD13_B_0X2         (0x2U<<26U)
#define GPIO_PUPDR_PUPD13_B_0X3         (0x3U<<26U)
#define GPIO_PUPDR_PUPD12_B_0X0         (0x0U<<24U)
#define GPIO_PUPDR_PUPD12_B_0X1         (0x1U<<24U)
#define GPIO_PUPDR_PUPD12_B_0X2         (0x2U<<24U)
#define GPIO_PUPDR_PUPD12_B_0X3         (0x3U<<24U)
#define GPIO_PUPDR_PUPD11_B_0X0         (0x0U<<22U)
#define GPIO_PUPDR_PUPD11_B_0X1         (0x1U<<22U)
#define GPIO_PUPDR_PUPD11_B_0X2         (0x2U<<22U)
#define GPIO_PUPDR_PUPD11_B_0X3         (0x3U<<22U)
#define GPIO_PUPDR_PUPD10_B_0X0         (0x0U<<20U)
#define GPIO_PUPDR_PUPD10_B_0X1         (0x1U<<20U)
#define GPIO_PUPDR_PUPD10_B_0X2         (0x2U<<20U)
#define GPIO_PUPDR_PUPD10_B_0X3         (0x3U<<20U)
#define GPIO_PUPDR_PUPD9_B_0X0          (0x0U<<18U)
#define GPIO_PUPDR_PUPD9_B_0X1          (0x1U<<18U)
#define GPIO_PUPDR_PUPD9_B_0X2          (0x2U<<18U)
#define GPIO_PUPDR_PUPD9_B_0X3          (0x3U<<18U)
#define GPIO_PUPDR_PUPD8_B_0X0          (0x0U<<16U)
#define GPIO_PUPDR_PUPD8_B_0X1          (0x1U<<16U)
#define GPIO_PUPDR_PUPD8_B_0X2          (0x2U<<16U)
#define GPIO_PUPDR_PUPD8_B_0X3          (0x3U<<16U)
#define GPIO_PUPDR_PUPD7_B_0X0          (0x0U<<14U)
#define GPIO_PUPDR_PUPD7_B_0X1          (0x1U<<14U)
#define GPIO_PUPDR_PUPD7_B_0X2          (0x2U<<14U)
#define GPIO_PUPDR_PUPD7_B_0X3          (0x3U<<14U)
#define GPIO_PUPDR_PUPD6_B_0X0          (0x0U<<12U)
#define GPIO_PUPDR_PUPD6_B_0X1          (0x1U<<12U)
#define GPIO_PUPDR_PUPD6_B_0X2          (0x2U<<12U)
#define GPIO_PUPDR_PUPD6_B_0X3          (0x3U<<12U)
#define GPIO_PUPDR_PUPD5_B_0X0          (0x0U<<10U)
#define GPIO_PUPDR_PUPD5_B_0X1          (0x1U<<10U)
#define GPIO_PUPDR_PUPD5_B_0X2          (0x2U<<10U)
#define GPIO_PUPDR_PUPD5_B_0X3          (0x3U<<10U)
#define GPIO_PUPDR_PUPD4_B_0X0          (0x0U<<8U)
#define GPIO_PUPDR_PUPD4_B_0X1          (0x1U<<8U)
#define GPIO_PUPDR_PUPD4_B_0X2          (0x2U<<8U)
#define GPIO_PUPDR_PUPD4_B_0X3          (0x3U<<8U)
#define GPIO_PUPDR_PUPD3_B_0X0          (0x0U<<6U)
#define GPIO_PUPDR_PUPD3_B_0X1          (0x1U<<6U)
#define GPIO_PUPDR_PUPD3_B_0X2          (0x2U<<6U)
#define GPIO_PUPDR_PUPD3_B_0X3          (0x3U<<6U)
#define GPIO_PUPDR_PUPD2_B_0X0          (0x0U<<4U)
#define GPIO_PUPDR_PUPD2_B_0X1          (0x1U<<4U)
#define GPIO_PUPDR_PUPD2_B_0X2          (0x2U<<4U)
#define GPIO_PUPDR_PUPD2_B_0X3          (0x3U<<4U)
#define GPIO_PUPDR_PUPD1_B_0X0          (0x0U<<2U)
#define GPIO_PUPDR_PUPD1_B_0X1          (0x1U<<2U)
#define GPIO_PUPDR_PUPD1_B_0X2          (0x2U<<2U)
#define GPIO_PUPDR_PUPD1_B_0X3          (0x3U<<2U)
#define GPIO_PUPDR_PUPD0_B_0X0          (0x0U<<0U)
#define GPIO_PUPDR_PUPD0_B_0X1          (0x1U<<0U)
#define GPIO_PUPDR_PUPD0_B_0X2          (0x2U<<0U)
#define GPIO_PUPDR_PUPD0_B_0X3          (0x3U<<0U)

// IDR Configuration

#define GPIO_IDR_ID15                   (0x1U<<15U)
#define GPIO_IDR_ID14                   (0x1U<<14U)
#define GPIO_IDR_ID13                   (0x1U<<13U)
#define GPIO_IDR_ID12                   (0x1U<<12U)
#define GPIO_IDR_ID11                   (0x1U<<11U)
#define GPIO_IDR_ID10                   (0x1U<<10U)
#define GPIO_IDR_ID9                    (0x1U<<9U)
#define GPIO_IDR_ID8                    (0x1U<<8U)
#define GPIO_IDR_ID7                    (0x1U<<7U)
#define GPIO_IDR_ID6                    (0x1U<<6U)
#define GPIO_IDR_ID5                    (0x1U<<5U)
#define GPIO_IDR_ID4                    (0x1U<<4U)
#define GPIO_IDR_ID3                    (0x1U<<3U)
#define GPIO_IDR_ID2                    (0x1U<<2U)
#define GPIO_IDR_ID1                    (0x1U<<1U)
#define GPIO_IDR_ID0                    (0x1U<<0U)

// ODR Configuration

#define GPIO_ODR_OD15                   (0x1U<<15U)
#define GPIO_ODR_OD14                   (0x1U<<14U)
#define GPIO_ODR_OD13                   (0x1U<<13U)
#define GPIO_ODR_OD12                   (0x1U<<12U)
#define GPIO_ODR_OD11                   (0x1U<<11U)
#define GPIO_ODR_OD10                   (0x1U<<10U)
#define GPIO_ODR_OD9                    (0x1U<<9U)
#define GPIO_ODR_OD8                    (0x1U<<8U)
#define GPIO_ODR_OD7                    (0x1U<<7U)
#define GPIO_ODR_OD6                    (0x1U<<6U)
#define GPIO_ODR_OD5                    (0x1U<<5U)
#define GPIO_ODR_OD4                    (0x1U<<4U)
#define GPIO_ODR_OD3                    (0x1U<<3U)
#define GPIO_ODR_OD2                    (0x1U<<2U)
#define GPIO_ODR_OD1                    (0x1U<<1U)
#define GPIO_ODR_OD0                    (0x1U<<0U)

// BSRR Configuration

#define GPIO_BSRR_BR15                  (0x1U<<31U)
#define GPIO_BSRR_BR14                  (0x1U<<30U)
#define GPIO_BSRR_BR13                  (0x1U<<29U)
#define GPIO_BSRR_BR12                  (0x1U<<28U)
#define GPIO_BSRR_BR11                  (0x1U<<27U)
#define GPIO_BSRR_BR10                  (0x1U<<26U)
#define GPIO_BSRR_BR9                   (0x1U<<25U)
#define GPIO_BSRR_BR8                   (0x1U<<24U)
#define GPIO_BSRR_BR7                   (0x1U<<23U)
#define GPIO_BSRR_BR6                   (0x1U<<22U)
#define GPIO_BSRR_BR5                   (0x1U<<21U)
#define GPIO_BSRR_BR4                   (0x1U<<20U)
#define GPIO_BSRR_BR3                   (0x1U<<19U)
#define GPIO_BSRR_BR2                   (0x1U<<18U)
#define GPIO_BSRR_BR1                   (0x1U<<17U)
#define GPIO_BSRR_BR0                   (0x1U<<16U)
#define GPIO_BSRR_BS15                  (0x1U<<15U)
#define GPIO_BSRR_BS14                  (0x1U<<14U)
#define GPIO_BSRR_BS13                  (0x1U<<13U)
#define GPIO_BSRR_BS12                  (0x1U<<12U)
#define GPIO_BSRR_BS11                  (0x1U<<11U)
#define GPIO_BSRR_BS10                  (0x1U<<10U)
#define GPIO_BSRR_BS9                   (0x1U<<9U)
#define GPIO_BSRR_BS8                   (0x1U<<8U)
#define GPIO_BSRR_BS7                   (0x1U<<7U)
#define GPIO_BSRR_BS6                   (0x1U<<6U)
#define GPIO_BSRR_BS5                   (0x1U<<5U)
#define GPIO_BSRR_BS4                   (0x1U<<4U)
#define GPIO_BSRR_BS3                   (0x1U<<3U)
#define GPIO_BSRR_BS2                   (0x1U<<2U)
#define GPIO_BSRR_BS1                   (0x1U<<1U)
#define GPIO_BSRR_BS0                   (0x1U<<0U)
#define GPIO_BSRR_BR15_B_0X0            (0x0U<<31U)
#define GPIO_BSRR_BR15_B_0X1            (0x1U<<31U)
#define GPIO_BSRR_BR14_B_0X0            (0x0U<<30U)
#define GPIO_BSRR_BR14_B_0X1            (0x1U<<30U)
#define GPIO_BSRR_BR13_B_0X0            (0x0U<<29U)
#define GPIO_BSRR_BR13_B_0X1            (0x1U<<29U)
#define GPIO_BSRR_BR12_B_0X0            (0x0U<<28U)
#define GPIO_BSRR_BR12_B_0X1            (0x1U<<28U)
#define GPIO_BSRR_BR11_B_0X0            (0x0U<<27U)
#define GPIO_BSRR_BR11_B_0X1            (0x1U<<27U)
#define GPIO_BSRR_BR10_B_0X0            (0x0U<<26U)
#define GPIO_BSRR_BR10_B_0X1            (0x1U<<26U)
#define GPIO_BSRR_BR9_B_0X0             (0x0U<<25U)
#define GPIO_BSRR_BR9_B_0X1             (0x1U<<25U)
#define GPIO_BSRR_BR8_B_0X0             (0x0U<<24U)
#define GPIO_BSRR_BR8_B_0X1             (0x1U<<24U)
#define GPIO_BSRR_BR7_B_0X0             (0x0U<<23U)
#define GPIO_BSRR_BR7_B_0X1             (0x1U<<23U)
#define GPIO_BSRR_BR6_B_0X0             (0x0U<<22U)
#define GPIO_BSRR_BR6_B_0X1             (0x1U<<22U)
#define GPIO_BSRR_BR5_B_0X0             (0x0U<<21U)
#define GPIO_BSRR_BR5_B_0X1             (0x1U<<21U)
#define GPIO_BSRR_BR4_B_0X0             (0x0U<<20U)
#define GPIO_BSRR_BR4_B_0X1             (0x1U<<20U)
#define GPIO_BSRR_BR3_B_0X0             (0x0U<<19U)
#define GPIO_BSRR_BR3_B_0X1             (0x1U<<19U)
#define GPIO_BSRR_BR2_B_0X0             (0x0U<<18U)
#define GPIO_BSRR_BR2_B_0X1             (0x1U<<18U)
#define GPIO_BSRR_BR1_B_0X0             (0x0U<<17U)
#define GPIO_BSRR_BR1_B_0X1             (0x1U<<17U)
#define GPIO_BSRR_BR0_B_0X0             (0x0U<<16U)
#define GPIO_BSRR_BR0_B_0X1             (0x1U<<16U)
#define GPIO_BSRR_BS15_B_0X0            (0x0U<<15U)
#define GPIO_BSRR_BS15_B_0X1            (0x1U<<15U)
#define GPIO_BSRR_BS14_B_0X0            (0x0U<<14U)
#define GPIO_BSRR_BS14_B_0X1            (0x1U<<14U)
#define GPIO_BSRR_BS13_B_0X0            (0x0U<<13U)
#define GPIO_BSRR_BS13_B_0X1            (0x1U<<13U)
#define GPIO_BSRR_BS12_B_0X0            (0x0U<<12U)
#define GPIO_BSRR_BS12_B_0X1            (0x1U<<12U)
#define GPIO_BSRR_BS11_B_0X0            (0x0U<<11U)
#define GPIO_BSRR_BS11_B_0X1            (0x1U<<11U)
#define GPIO_BSRR_BS10_B_0X0            (0x0U<<10U)
#define GPIO_BSRR_BS10_B_0X1            (0x1U<<10U)
#define GPIO_BSRR_BS9_B_0X0             (0x0U<<9U)
#define GPIO_BSRR_BS9_B_0X1             (0x1U<<9U)
#define GPIO_BSRR_BS8_B_0X0             (0x0U<<8U)
#define GPIO_BSRR_BS8_B_0X1             (0x1U<<8U)
#define GPIO_BSRR_BS7_B_0X0             (0x0U<<7U)
#define GPIO_BSRR_BS7_B_0X1             (0x1U<<7U)
#define GPIO_BSRR_BS6_B_0X0             (0x0U<<6U)
#define GPIO_BSRR_BS6_B_0X1             (0x1U<<6U)
#define GPIO_BSRR_BS5_B_0X0             (0x0U<<5U)
#define GPIO_BSRR_BS5_B_0X1             (0x1U<<5U)
#define GPIO_BSRR_BS4_B_0X0             (0x0U<<4U)
#define GPIO_BSRR_BS4_B_0X1             (0x1U<<4U)
#define GPIO_BSRR_BS3_B_0X0             (0x0U<<3U)
#define GPIO_BSRR_BS3_B_0X1             (0x1U<<3U)
#define GPIO_BSRR_BS2_B_0X0             (0x0U<<2U)
#define GPIO_BSRR_BS2_B_0X1             (0x1U<<2U)
#define GPIO_BSRR_BS1_B_0X0             (0x0U<<1U)
#define GPIO_BSRR_BS1_B_0X1             (0x1U<<1U)
#define GPIO_BSRR_BS0_B_0X0             (0x0U<<0U)
#define GPIO_BSRR_BS0_B_0X1             (0x1U<<0U)

// LCKR Configuration

#define GPIO_LCKR_LCKK                  (0x1U<<16U)
#define GPIO_LCKR_LCK15                 (0x1U<<15U)
#define GPIO_LCKR_LCK14                 (0x1U<<14U)
#define GPIO_LCKR_LCK13                 (0x1U<<13U)
#define GPIO_LCKR_LCK12                 (0x1U<<12U)
#define GPIO_LCKR_LCK11                 (0x1U<<11U)
#define GPIO_LCKR_LCK10                 (0x1U<<10U)
#define GPIO_LCKR_LCK9                  (0x1U<<9U)
#define GPIO_LCKR_LCK8                  (0x1U<<8U)
#define GPIO_LCKR_LCK7                  (0x1U<<7U)
#define GPIO_LCKR_LCK6                  (0x1U<<6U)
#define GPIO_LCKR_LCK5                  (0x1U<<5U)
#define GPIO_LCKR_LCK4                  (0x1U<<4U)
#define GPIO_LCKR_LCK3                  (0x1U<<3U)
#define GPIO_LCKR_LCK2                  (0x1U<<2U)
#define GPIO_LCKR_LCK1                  (0x1U<<1U)
#define GPIO_LCKR_LCK0                  (0x1U<<0U)
#define GPIO_LCKR_LCKK_B_0X0            (0x0U<<16U)
#define GPIO_LCKR_LCKK_B_0X1            (0x1U<<16U)
#define GPIO_LCKR_LCK15_B_0X0           (0x0U<<15U)
#define GPIO_LCKR_LCK15_B_0X1           (0x1U<<15U)
#define GPIO_LCKR_LCK14_B_0X0           (0x0U<<14U)
#define GPIO_LCKR_LCK14_B_0X1           (0x1U<<14U)
#define GPIO_LCKR_LCK13_B_0X0           (0x0U<<13U)
#define GPIO_LCKR_LCK13_B_0X1           (0x1U<<13U)
#define GPIO_LCKR_LCK12_B_0X0           (0x0U<<12U)
#define GPIO_LCKR_LCK12_B_0X1           (0x1U<<12U)
#define GPIO_LCKR_LCK11_B_0X0           (0x0U<<11U)
#define GPIO_LCKR_LCK11_B_0X1           (0x1U<<11U)
#define GPIO_LCKR_LCK10_B_0X0           (0x0U<<10U)
#define GPIO_LCKR_LCK10_B_0X1           (0x1U<<10U)
#define GPIO_LCKR_LCK9_B_0X0            (0x0U<<9U)
#define GPIO_LCKR_LCK9_B_0X1            (0x1U<<9U)
#define GPIO_LCKR_LCK8_B_0X0            (0x0U<<8U)
#define GPIO_LCKR_LCK8_B_0X1            (0x1U<<8U)
#define GPIO_LCKR_LCK7_B_0X0            (0x0U<<7U)
#define GPIO_LCKR_LCK7_B_0X1            (0x1U<<7U)
#define GPIO_LCKR_LCK6_B_0X0            (0x0U<<6U)
#define GPIO_LCKR_LCK6_B_0X1            (0x1U<<6U)
#define GPIO_LCKR_LCK5_B_0X0            (0x0U<<5U)
#define GPIO_LCKR_LCK5_B_0X1            (0x1U<<5U)
#define GPIO_LCKR_LCK4_B_0X0            (0x0U<<4U)
#define GPIO_LCKR_LCK4_B_0X1            (0x1U<<4U)
#define GPIO_LCKR_LCK3_B_0X0            (0x0U<<3U)
#define GPIO_LCKR_LCK3_B_0X1            (0x1U<<3U)
#define GPIO_LCKR_LCK2_B_0X0            (0x0U<<2U)
#define GPIO_LCKR_LCK2_B_0X1            (0x1U<<2U)
#define GPIO_LCKR_LCK1_B_0X0            (0x0U<<1U)
#define GPIO_LCKR_LCK1_B_0X1            (0x1U<<1U)
#define GPIO_LCKR_LCK0_B_0X0            (0x0U<<0U)
#define GPIO_LCKR_LCK0_B_0X1            (0x1U<<0U)

