Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpio.h
// AFRL Configuration

#define GPIO_AFRL_AFSEL7                (0xFU<<28U)
#define GPIO_AFRL_AFSEL7_0              (0x1U<<28U)
#define GPIO_AFRL_AFSEL6                (0xFU<<24U)
#define GPIO_AFRL_AFSEL6_0              (0x1U<<24U)
#define GPIO_AFRL_AFSEL5                (0xFU<<20U)
#define GPIO_AFRL_AFSEL5_0              (0x1U<<20U)
#define GPIO_AFRL_AFSEL4                (0xFU<<16U)
#define GPIO_AFRL_AFSEL4_0              (0x1U<<16U)
#define GPIO_AFRL_AFSEL3                (0xFU<<12U)
#define GPIO_AFRL_AFSEL3_0              (0x1U<<12U)
#define GPIO_AFRL_AFSEL2                (0xFU<<8U)
#define GPIO_AFRL_AFSEL2_0              (0x1U<<8U)
#define GPIO_AFRL_AFSEL1                (0xFU<<4U)
#define GPIO_AFRL_AFSEL1_0              (0x1U<<4U)
#define GPIO_AFRL_AFSEL0                (0xFU<<0U)
#define GPIO_AFRL_AFSEL0_0              (0x1U<<0U)
#define GPIO_AFRL_AFSEL7_B_0X0          (0x0U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X1          (0x1U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X2          (0x2U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X3          (0x3U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X4          (0x4U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X5          (0x5U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X6          (0x6U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X7          (0x7U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X8          (0x8U<<28U)
#define GPIO_AFRL_AFSEL7_B_0X9          (0x9U<<28U)
#define GPIO_AFRL_AFSEL7_B_0XA          (0xAU<<28U)
#define GPIO_AFRL_AFSEL7_B_0XB          (0xBU<<28U)
#define GPIO_AFRL_AFSEL7_B_0XC          (0xCU<<28U)
#define GPIO_AFRL_AFSEL7_B_0XD          (0xDU<<28U)
#define GPIO_AFRL_AFSEL7_B_0XE          (0xEU<<28U)
#define GPIO_AFRL_AFSEL7_B_0XF          (0xFU<<28U)
#define GPIO_AFRL_AFSEL6_B_0X0          (0x0U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X1          (0x1U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X2          (0x2U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X3          (0x3U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X4          (0x4U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X5          (0x5U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X6          (0x6U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X7          (0x7U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X8          (0x8U<<24U)
#define GPIO_AFRL_AFSEL6_B_0X9          (0x9U<<24U)
#define GPIO_AFRL_AFSEL6_B_0XA          (0xAU<<24U)
#define GPIO_AFRL_AFSEL6_B_0XB          (0xBU<<24U)
#define GPIO_AFRL_AFSEL6_B_0XC          (0xCU<<24U)
#define GPIO_AFRL_AFSEL6_B_0XD          (0xDU<<24U)
#define GPIO_AFRL_AFSEL6_B_0XE          (0xEU<<24U)
#define GPIO_AFRL_AFSEL6_B_0XF          (0xFU<<24U)
#define GPIO_AFRL_AFSEL5_B_0X0          (0x0U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X1          (0x1U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X2          (0x2U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X3          (0x3U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X4          (0x4U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X5          (0x5U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X6          (0x6U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X7          (0x7U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X8          (0x8U<<20U)
#define GPIO_AFRL_AFSEL5_B_0X9          (0x9U<<20U)
#define GPIO_AFRL_AFSEL5_B_0XA          (0xAU<<20U)
#define GPIO_AFRL_AFSEL5_B_0XB          (0xBU<<20U)
#define GPIO_AFRL_AFSEL5_B_0XC          (0xCU<<20U)
#define GPIO_AFRL_AFSEL5_B_0XD          (0xDU<<20U)
#define GPIO_AFRL_AFSEL5_B_0XE          (0xEU<<20U)
#define GPIO_AFRL_AFSEL5_B_0XF          (0xFU<<20U)
#define GPIO_AFRL_AFSEL4_B_0X0          (0x0U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X1          (0x1U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X2          (0x2U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X3          (0x3U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X4          (0x4U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X5          (0x5U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X6          (0x6U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X7          (0x7U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X8          (0x8U<<16U)
#define GPIO_AFRL_AFSEL4_B_0X9          (0x9U<<16U)
#define GPIO_AFRL_AFSEL4_B_0XA          (0xAU<<16U)
#define GPIO_AFRL_AFSEL4_B_0XB          (0xBU<<16U)
#define GPIO_AFRL_AFSEL4_B_0XC          (0xCU<<16U)
#define GPIO_AFRL_AFSEL4_B_0XD          (0xDU<<16U)
#define GPIO_AFRL_AFSEL4_B_0XE          (0xEU<<16U)
#define GPIO_AFRL_AFSEL4_B_0XF          (0xFU<<16U)
#define GPIO_AFRL_AFSEL3_B_0X0          (0x0U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X1          (0x1U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X2          (0x2U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X3          (0x3U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X4          (0x4U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X5          (0x5U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X6          (0x6U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X7          (0x7U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X8          (0x8U<<12U)
#define GPIO_AFRL_AFSEL3_B_0X9          (0x9U<<12U)
#define GPIO_AFRL_AFSEL3_B_0XA          (0xAU<<12U)
#define GPIO_AFRL_AFSEL3_B_0XB          (0xBU<<12U)
#define GPIO_AFRL_AFSEL3_B_0XC          (0xCU<<12U)
#define GPIO_AFRL_AFSEL3_B_0XD          (0xDU<<12U)
#define GPIO_AFRL_AFSEL3_B_0XE          (0xEU<<12U)
#define GPIO_AFRL_AFSEL3_B_0XF          (0xFU<<12U)
#define GPIO_AFRL_AFSEL2_B_0X0          (0x0U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X1          (0x1U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X2          (0x2U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X3          (0x3U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X4          (0x4U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X5          (0x5U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X6          (0x6U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X7          (0x7U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X8          (0x8U<<8U)
#define GPIO_AFRL_AFSEL2_B_0X9          (0x9U<<8U)
#define GPIO_AFRL_AFSEL2_B_0XA          (0xAU<<8U)
#define GPIO_AFRL_AFSEL2_B_0XB          (0xBU<<8U)
#define GPIO_AFRL_AFSEL2_B_0XC          (0xCU<<8U)
#define GPIO_AFRL_AFSEL2_B_0XD          (0xDU<<8U)
#define GPIO_AFRL_AFSEL2_B_0XE          (0xEU<<8U)
#define GPIO_AFRL_AFSEL2_B_0XF          (0xFU<<8U)
#define GPIO_AFRL_AFSEL1_B_0X0          (0x0U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X1          (0x1U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X2          (0x2U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X3          (0x3U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X4          (0x4U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X5          (0x5U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X6          (0x6U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X7          (0x7U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X8          (0x8U<<4U)
#define GPIO_AFRL_AFSEL1_B_0X9          (0x9U<<4U)
#define GPIO_AFRL_AFSEL1_B_0XA          (0xAU<<4U)
#define GPIO_AFRL_AFSEL1_B_0XB          (0xBU<<4U)
#define GPIO_AFRL_AFSEL1_B_0XC          (0xCU<<4U)
#define GPIO_AFRL_AFSEL1_B_0XD          (0xDU<<4U)
#define GPIO_AFRL_AFSEL1_B_0XE          (0xEU<<4U)
#define GPIO_AFRL_AFSEL1_B_0XF          (0xFU<<4U)
#define GPIO_AFRL_AFSEL0_B_0X0          (0x0U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X1          (0x1U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X2          (0x2U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X3          (0x3U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X4          (0x4U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X5          (0x5U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X6          (0x6U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X7          (0x7U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X8          (0x8U<<0U)
#define GPIO_AFRL_AFSEL0_B_0X9          (0x9U<<0U)
#define GPIO_AFRL_AFSEL0_B_0XA          (0xAU<<0U)
#define GPIO_AFRL_AFSEL0_B_0XB          (0xBU<<0U)
#define GPIO_AFRL_AFSEL0_B_0XC          (0xCU<<0U)
#define GPIO_AFRL_AFSEL0_B_0XD          (0xDU<<0U)
#define GPIO_AFRL_AFSEL0_B_0XE          (0xEU<<0U)
#define GPIO_AFRL_AFSEL0_B_0XF          (0xFU<<0U)

// AFRH Configuration

#define GPIO_AFRH_AFSEL15               (0xFU<<28U)
#define GPIO_AFRH_AFSEL15_0             (0x1U<<28U)
#define GPIO_AFRH_AFSEL14               (0xFU<<24U)
#define GPIO_AFRH_AFSEL14_0             (0x1U<<24U)
#define GPIO_AFRH_AFSEL13               (0xFU<<20U)
#define GPIO_AFRH_AFSEL13_0             (0x1U<<20U)
#define GPIO_AFRH_AFSEL12               (0xFU<<16U)
#define GPIO_AFRH_AFSEL12_0             (0x1U<<16U)
#define GPIO_AFRH_AFSEL11               (0xFU<<12U)
#define GPIO_AFRH_AFSEL11_0             (0x1U<<12U)
#define GPIO_AFRH_AFSEL10               (0xFU<<8U)
#define GPIO_AFRH_AFSEL10_0             (0x1U<<8U)
#define GPIO_AFRH_AFSEL9                (0xFU<<4U)
#define GPIO_AFRH_AFSEL9_0              (0x1U<<4U)
#define GPIO_AFRH_AFSEL8                (0xFU<<0U)
#define GPIO_AFRH_AFSEL8_0              (0x1U<<0U)
#define GPIO_AFRH_AFSEL15_B_0X0         (0x0U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X1         (0x1U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X2         (0x2U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X3         (0x3U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X4         (0x4U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X5         (0x5U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X6         (0x6U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X7         (0x7U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X8         (0x8U<<28U)
#define GPIO_AFRH_AFSEL15_B_0X9         (0x9U<<28U)
#define GPIO_AFRH_AFSEL15_B_0XA         (0xAU<<28U)
#define GPIO_AFRH_AFSEL15_B_0XB         (0xBU<<28U)
#define GPIO_AFRH_AFSEL15_B_0XC         (0xCU<<28U)
#define GPIO_AFRH_AFSEL15_B_0XD         (0xDU<<28U)
#define GPIO_AFRH_AFSEL15_B_0XE         (0xEU<<28U)
#define GPIO_AFRH_AFSEL15_B_0XF         (0xFU<<28U)
#define GPIO_AFRH_AFSEL14_B_0X0         (0x0U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X1         (0x1U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X2         (0x2U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X3         (0x3U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X4         (0x4U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X5         (0x5U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X6         (0x6U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X7         (0x7U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X8         (0x8U<<24U)
#define GPIO_AFRH_AFSEL14_B_0X9         (0x9U<<24U)
#define GPIO_AFRH_AFSEL14_B_0XA         (0xAU<<24U)
#define GPIO_AFRH_AFSEL14_B_0XB         (0xBU<<24U)
#define GPIO_AFRH_AFSEL14_B_0XC         (0xCU<<24U)
#define GPIO_AFRH_AFSEL14_B_0XD         (0xDU<<24U)
#define GPIO_AFRH_AFSEL14_B_0XE         (0xEU<<24U)
#define GPIO_AFRH_AFSEL14_B_0XF         (0xFU<<24U)
#define GPIO_AFRH_AFSEL13_B_0X0         (0x0U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X1         (0x1U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X2         (0x2U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X3         (0x3U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X4         (0x4U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X5         (0x5U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X6         (0x6U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X7         (0x7U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X8         (0x8U<<20U)
#define GPIO_AFRH_AFSEL13_B_0X9         (0x9U<<20U)
#define GPIO_AFRH_AFSEL13_B_0XA         (0xAU<<20U)
#define GPIO_AFRH_AFSEL13_B_0XB         (0xBU<<20U)
#define GPIO_AFRH_AFSEL13_B_0XC         (0xCU<<20U)
#define GPIO_AFRH_AFSEL13_B_0XD         (0xDU<<20U)
#define GPIO_AFRH_AFSEL13_B_0XE         (0xEU<<20U)
#define GPIO_AFRH_AFSEL13_B_0XF         (0xFU<<20U)
#define GPIO_AFRH_AFSEL12_B_0X0         (0x0U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X1         (0x1U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X2         (0x2U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X3         (0x3U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X4         (0x4U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X5         (0x5U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X6         (0x6U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X7         (0x7U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X8         (0x8U<<16U)
#define GPIO_AFRH_AFSEL12_B_0X9         (0x9U<<16U)
#define GPIO_AFRH_AFSEL12_B_0XA         (0xAU<<16U)
#define GPIO_AFRH_AFSEL12_B_0XB         (0xBU<<16U)
#define GPIO_AFRH_AFSEL12_B_0XC         (0xCU<<16U)
#define GPIO_AFRH_AFSEL12_B_0XD         (0xDU<<16U)
#define GPIO_AFRH_AFSEL12_B_0XE         (0xEU<<16U)
#define GPIO_AFRH_AFSEL12_B_0XF         (0xFU<<16U)
#define GPIO_AFRH_AFSEL11_B_0X0         (0x0U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X1         (0x1U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X2         (0x2U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X3         (0x3U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X4         (0x4U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X5         (0x5U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X6         (0x6U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X7         (0x7U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X8         (0x8U<<12U)
#define GPIO_AFRH_AFSEL11_B_0X9         (0x9U<<12U)
#define GPIO_AFRH_AFSEL11_B_0XA         (0xAU<<12U)
#define GPIO_AFRH_AFSEL11_B_0XB         (0xBU<<12U)
#define GPIO_AFRH_AFSEL11_B_0XC         (0xCU<<12U)
#define GPIO_AFRH_AFSEL11_B_0XD         (0xDU<<12U)
#define GPIO_AFRH_AFSEL11_B_0XE         (0xEU<<12U)
#define GPIO_AFRH_AFSEL11_B_0XF         (0xFU<<12U)
#define GPIO_AFRH_AFSEL10_B_0X0         (0x0U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X1         (0x1U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X2         (0x2U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X3         (0x3U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X4         (0x4U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X5         (0x5U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X6         (0x6U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X7         (0x7U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X8         (0x8U<<8U)
#define GPIO_AFRH_AFSEL10_B_0X9         (0x9U<<8U)
#define GPIO_AFRH_AFSEL10_B_0XA         (0xAU<<8U)
#define GPIO_AFRH_AFSEL10_B_0XB         (0xBU<<8U)
#define GPIO_AFRH_AFSEL10_B_0XC         (0xCU<<8U)
#define GPIO_AFRH_AFSEL10_B_0XD         (0xDU<<8U)
#define GPIO_AFRH_AFSEL10_B_0XE         (0xEU<<8U)
#define GPIO_AFRH_AFSEL10_B_0XF         (0xFU<<8U)
#define GPIO_AFRH_AFSEL9_B_0X0          (0x0U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X1          (0x1U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X2          (0x2U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X3          (0x3U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X4          (0x4U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X5          (0x5U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X6          (0x6U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X7          (0x7U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X8          (0x8U<<4U)
#define GPIO_AFRH_AFSEL9_B_0X9          (0x9U<<4U)
#define GPIO_AFRH_AFSEL9_B_0XA          (0xAU<<4U)
#define GPIO_AFRH_AFSEL9_B_0XB          (0xBU<<4U)
#define GPIO_AFRH_AFSEL9_B_0XC          (0xCU<<4U)
#define GPIO_AFRH_AFSEL9_B_0XD          (0xDU<<4U)
#define GPIO_AFRH_AFSEL9_B_0XE          (0xEU<<4U)
#define GPIO_AFRH_AFSEL9_B_0XF          (0xFU<<4U)
#define GPIO_AFRH_AFSEL8_B_0X0          (0x0U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X1          (0x1U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X2          (0x2U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X3          (0x3U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X4          (0x4U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X5          (0x5U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X6          (0x6U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X7          (0x7U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X8          (0x8U<<0U)
#define GPIO_AFRH_AFSEL8_B_0X9          (0x9U<<0U)
#define GPIO_AFRH_AFSEL8_B_0XA          (0xAU<<0U)
#define GPIO_AFRH_AFSEL8_B_0XB          (0xBU<<0U)
#define GPIO_AFRH_AFSEL8_B_0XC          (0xCU<<0U)
#define GPIO_AFRH_AFSEL8_B_0XD          (0xDU<<0U)
#define GPIO_AFRH_AFSEL8_B_0XE          (0xEU<<0U)
#define GPIO_AFRH_AFSEL8_B_0XF          (0xFU<<0U)

// BRR Configuration

