Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gpio.h
#define GPIO_BRR_BR15                   (0x1U<<15U)
#define GPIO_BRR_BR14                   (0x1U<<14U)
#define GPIO_BRR_BR13                   (0x1U<<13U)
#define GPIO_BRR_BR12                   (0x1U<<12U)
#define GPIO_BRR_BR11                   (0x1U<<11U)
#define GPIO_BRR_BR10                   (0x1U<<10U)
#define GPIO_BRR_BR9                    (0x1U<<9U)
#define GPIO_BRR_BR8                    (0x1U<<8U)
#define GPIO_BRR_BR7                    (0x1U<<7U)
#define GPIO_BRR_BR6                    (0x1U<<6U)
#define GPIO_BRR_BR5                    (0x1U<<5U)
#define GPIO_BRR_BR4                    (0x1U<<4U)
#define GPIO_BRR_BR3                    (0x1U<<3U)
#define GPIO_BRR_BR2                    (0x1U<<2U)
#define GPIO_BRR_BR1                    (0x1U<<1U)
#define GPIO_BRR_BR0                    (0x1U<<0U)
#define GPIO_BRR_BR15_B_0X0             (0x0U<<15U)
#define GPIO_BRR_BR15_B_0X1             (0x1U<<15U)
#define GPIO_BRR_BR14_B_0X0             (0x0U<<14U)
#define GPIO_BRR_BR14_B_0X1             (0x1U<<14U)
#define GPIO_BRR_BR13_B_0X0             (0x0U<<13U)
#define GPIO_BRR_BR13_B_0X1             (0x1U<<13U)
#define GPIO_BRR_BR12_B_0X0             (0x0U<<12U)
#define GPIO_BRR_BR12_B_0X1             (0x1U<<12U)
#define GPIO_BRR_BR11_B_0X0             (0x0U<<11U)
#define GPIO_BRR_BR11_B_0X1             (0x1U<<11U)
#define GPIO_BRR_BR10_B_0X0             (0x0U<<10U)
#define GPIO_BRR_BR10_B_0X1             (0x1U<<10U)
#define GPIO_BRR_BR9_B_0X0              (0x0U<<9U)
#define GPIO_BRR_BR9_B_0X1              (0x1U<<9U)
#define GPIO_BRR_BR8_B_0X0              (0x0U<<8U)
#define GPIO_BRR_BR8_B_0X1              (0x1U<<8U)
#define GPIO_BRR_BR7_B_0X0              (0x0U<<7U)
#define GPIO_BRR_BR7_B_0X1              (0x1U<<7U)
#define GPIO_BRR_BR6_B_0X0              (0x0U<<6U)
#define GPIO_BRR_BR6_B_0X1              (0x1U<<6U)
#define GPIO_BRR_BR5_B_0X0              (0x0U<<5U)
#define GPIO_BRR_BR5_B_0X1              (0x1U<<5U)
#define GPIO_BRR_BR4_B_0X0              (0x0U<<4U)
#define GPIO_BRR_BR4_B_0X1              (0x1U<<4U)
#define GPIO_BRR_BR3_B_0X0              (0x0U<<3U)
#define GPIO_BRR_BR3_B_0X1              (0x1U<<3U)
#define GPIO_BRR_BR2_B_0X0              (0x0U<<2U)
#define GPIO_BRR_BR2_B_0X1              (0x1U<<2U)
#define GPIO_BRR_BR1_B_0X0              (0x0U<<1U)
#define GPIO_BRR_BR1_B_0X1              (0x1U<<1U)
#define GPIO_BRR_BR0_B_0X0              (0x0U<<0U)
#define GPIO_BRR_BR0_B_0X1              (0x1U<<0U)

// HSLVR Configuration

#define GPIO_HSLVR_HSLV15               (0x1U<<15U)
#define GPIO_HSLVR_HSLV14               (0x1U<<14U)
#define GPIO_HSLVR_HSLV13               (0x1U<<13U)
#define GPIO_HSLVR_HSLV12               (0x1U<<12U)
#define GPIO_HSLVR_HSLV11               (0x1U<<11U)
#define GPIO_HSLVR_HSLV10               (0x1U<<10U)
#define GPIO_HSLVR_HSLV9                (0x1U<<9U)
#define GPIO_HSLVR_HSLV8                (0x1U<<8U)
#define GPIO_HSLVR_HSLV7                (0x1U<<7U)
#define GPIO_HSLVR_HSLV6                (0x1U<<6U)
#define GPIO_HSLVR_HSLV5                (0x1U<<5U)
#define GPIO_HSLVR_HSLV4                (0x1U<<4U)
#define GPIO_HSLVR_HSLV3                (0x1U<<3U)
#define GPIO_HSLVR_HSLV2                (0x1U<<2U)
#define GPIO_HSLVR_HSLV1                (0x1U<<1U)
#define GPIO_HSLVR_HSLV0                (0x1U<<0U)
#define GPIO_HSLVR_HSLV15_B_0X0         (0x0U<<15U)
#define GPIO_HSLVR_HSLV15_B_0X1         (0x1U<<15U)
#define GPIO_HSLVR_HSLV14_B_0X0         (0x0U<<14U)
#define GPIO_HSLVR_HSLV14_B_0X1         (0x1U<<14U)
#define GPIO_HSLVR_HSLV13_B_0X0         (0x0U<<13U)
#define GPIO_HSLVR_HSLV13_B_0X1         (0x1U<<13U)
#define GPIO_HSLVR_HSLV12_B_0X0         (0x0U<<12U)
#define GPIO_HSLVR_HSLV12_B_0X1         (0x1U<<12U)
#define GPIO_HSLVR_HSLV11_B_0X0         (0x0U<<11U)
#define GPIO_HSLVR_HSLV11_B_0X1         (0x1U<<11U)
#define GPIO_HSLVR_HSLV10_B_0X0         (0x0U<<10U)
#define GPIO_HSLVR_HSLV10_B_0X1         (0x1U<<10U)
#define GPIO_HSLVR_HSLV9_B_0X0          (0x0U<<9U)
#define GPIO_HSLVR_HSLV9_B_0X1          (0x1U<<9U)
#define GPIO_HSLVR_HSLV8_B_0X0          (0x0U<<8U)
#define GPIO_HSLVR_HSLV8_B_0X1          (0x1U<<8U)
#define GPIO_HSLVR_HSLV7_B_0X0          (0x0U<<7U)
#define GPIO_HSLVR_HSLV7_B_0X1          (0x1U<<7U)
#define GPIO_HSLVR_HSLV6_B_0X0          (0x0U<<6U)
#define GPIO_HSLVR_HSLV6_B_0X1          (0x1U<<6U)
#define GPIO_HSLVR_HSLV5_B_0X0          (0x0U<<5U)
#define GPIO_HSLVR_HSLV5_B_0X1          (0x1U<<5U)
#define GPIO_HSLVR_HSLV4_B_0X0          (0x0U<<4U)
#define GPIO_HSLVR_HSLV4_B_0X1          (0x1U<<4U)
#define GPIO_HSLVR_HSLV3_B_0X0          (0x0U<<3U)
#define GPIO_HSLVR_HSLV3_B_0X1          (0x1U<<3U)
#define GPIO_HSLVR_HSLV2_B_0X0          (0x0U<<2U)
#define GPIO_HSLVR_HSLV2_B_0X1          (0x1U<<2U)
#define GPIO_HSLVR_HSLV1_B_0X0          (0x0U<<1U)
#define GPIO_HSLVR_HSLV1_B_0X1          (0x1U<<1U)
#define GPIO_HSLVR_HSLV0_B_0X0          (0x0U<<0U)
#define GPIO_HSLVR_HSLV0_B_0X1          (0x1U<<0U)

// SECCFGR Configuration

#define GPIO_SECCFGR_SEC15              (0x1U<<15U)
#define GPIO_SECCFGR_SEC14              (0x1U<<14U)
#define GPIO_SECCFGR_SEC13              (0x1U<<13U)
#define GPIO_SECCFGR_SEC12              (0x1U<<12U)
#define GPIO_SECCFGR_SEC11              (0x1U<<11U)
#define GPIO_SECCFGR_SEC10              (0x1U<<10U)
#define GPIO_SECCFGR_SEC9               (0x1U<<9U)
#define GPIO_SECCFGR_SEC8               (0x1U<<8U)
#define GPIO_SECCFGR_SEC7               (0x1U<<7U)
#define GPIO_SECCFGR_SEC6               (0x1U<<6U)
#define GPIO_SECCFGR_SEC5               (0x1U<<5U)
#define GPIO_SECCFGR_SEC4               (0x1U<<4U)
#define GPIO_SECCFGR_SEC3               (0x1U<<3U)
#define GPIO_SECCFGR_SEC2               (0x1U<<2U)
#define GPIO_SECCFGR_SEC1               (0x1U<<1U)
#define GPIO_SECCFGR_SEC0               (0x1U<<0U)
#define GPIO_SECCFGR_SEC15_B_0X0        (0x0U<<15U)
#define GPIO_SECCFGR_SEC15_B_0X1        (0x1U<<15U)
#define GPIO_SECCFGR_SEC14_B_0X0        (0x0U<<14U)
#define GPIO_SECCFGR_SEC14_B_0X1        (0x1U<<14U)
#define GPIO_SECCFGR_SEC13_B_0X0        (0x0U<<13U)
#define GPIO_SECCFGR_SEC13_B_0X1        (0x1U<<13U)
#define GPIO_SECCFGR_SEC12_B_0X0        (0x0U<<12U)
#define GPIO_SECCFGR_SEC12_B_0X1        (0x1U<<12U)
#define GPIO_SECCFGR_SEC11_B_0X0        (0x0U<<11U)
#define GPIO_SECCFGR_SEC11_B_0X1        (0x1U<<11U)
#define GPIO_SECCFGR_SEC10_B_0X0        (0x0U<<10U)
#define GPIO_SECCFGR_SEC10_B_0X1        (0x1U<<10U)
#define GPIO_SECCFGR_SEC9_B_0X0         (0x0U<<9U)
#define GPIO_SECCFGR_SEC9_B_0X1         (0x1U<<9U)
#define GPIO_SECCFGR_SEC8_B_0X0         (0x0U<<8U)
#define GPIO_SECCFGR_SEC8_B_0X1         (0x1U<<8U)
#define GPIO_SECCFGR_SEC7_B_0X0         (0x0U<<7U)
#define GPIO_SECCFGR_SEC7_B_0X1         (0x1U<<7U)
#define GPIO_SECCFGR_SEC6_B_0X0         (0x0U<<6U)
#define GPIO_SECCFGR_SEC6_B_0X1         (0x1U<<6U)
#define GPIO_SECCFGR_SEC5_B_0X0         (0x0U<<5U)
#define GPIO_SECCFGR_SEC5_B_0X1         (0x1U<<5U)
#define GPIO_SECCFGR_SEC4_B_0X0         (0x0U<<4U)
#define GPIO_SECCFGR_SEC4_B_0X1         (0x1U<<4U)
#define GPIO_SECCFGR_SEC3_B_0X0         (0x0U<<3U)
#define GPIO_SECCFGR_SEC3_B_0X1         (0x1U<<3U)
#define GPIO_SECCFGR_SEC2_B_0X0         (0x0U<<2U)
#define GPIO_SECCFGR_SEC2_B_0X1         (0x1U<<2U)
#define GPIO_SECCFGR_SEC1_B_0X0         (0x0U<<1U)
#define GPIO_SECCFGR_SEC1_B_0X1         (0x1U<<1U)
#define GPIO_SECCFGR_SEC0_B_0X0         (0x0U<<0U)
#define GPIO_SECCFGR_SEC0_B_0X1         (0x1U<<0U)
